#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ecs_ssm_sops.data.sops_file.sops_secret: Reading...
module.ecs_ssm_sops.data.sops_file.sops_secret: Read complete after 0s [id=-]
module.ecs_acm.data.aws_route53_zone.public: Reading...
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.main: Reading...
module.ecs_ssm_sops.aws_ssm_parameter.main["DB_HOSTNAME"]: Refreshing state... [id=DB_HOSTNAME]
module.ecs_ssm_sops.aws_ssm_parameter.main["DB_PASSWORD"]: Refreshing state... [id=DB_PASSWORD]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.custom: Reading...
module.ecs_ssm_sops.aws_ssm_parameter.main["DB_USERNAME"]: Refreshing state... [id=DB_USERNAME]
module.ecr.aws_ecr_repository.main: Refreshing state... [id=travelapp-ecr]
module.ecs_acm.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:us-east-1:378842471989:certificate/75d5d227-b630-4d55-918e-271ef768fc32]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.main: Read complete after 0s [id=1077804475]
module.ecs_cluster.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:378842471989:cluster/travelapp-cluster]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-07370bdafa53b8c4f]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.custom: Read complete after 0s [id=3750463013]
module.ecs_r53.data.aws_route53_zone.public: Reading...
module.ecs_taskdef_travelapp.aws_iam_role.main: Refreshing state... [id=ECS-TravelApp-Role]
module.ecs_taskdef_travelapp.aws_iam_policy.main: Refreshing state... [id=arn:aws:iam::378842471989:policy/ECS-Allow-All]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.example: Refreshing state... [id=travelapp-cluster]
module.ecs_acm.aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.ecs_taskdef_travelapp.aws_ecs_task_definition.main: Refreshing state... [id=travelapp-taskdefintion]
module.ecs_acm.data.aws_route53_zone.public: Read complete after 1s [id=Z00595491K8FFQ0O1DVA]
module.ecs_acm.aws_route53_record.cert_validation: Refreshing state... [id=Z00595491K8FFQ0O1DVA__0d9b0d7851559e40dab034033ad9f291.travelapp.bernatei.com._CNAME]
module.ecs_taskdef_travelapp.aws_iam_role_policy_attachment.main: Refreshing state... [id=ECS-TravelApp-Role-20231214174657259600000001]
module.ecs_r53.data.aws_route53_zone.public: Read complete after 1s [id=Z00595491K8FFQ0O1DVA]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-03ab51c457fad06d3]
module.vpc.aws_route_table.main: Refreshing state... [id=rtb-0299c90bb8997687c]
module.vpc.aws_subnet.public_subnets[1]: Refreshing state... [id=subnet-0299bc63a7ad5223e]
module.vpc.aws_subnet.public_subnets[0]: Refreshing state... [id=subnet-01a9331b22ab97a18]
module.ecs_alb.aws_alb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:targetgroup/travelapp-tg/f878bbd886c2b078]
module.rds_public_sg.aws_security_group.main: Refreshing state... [id=sg-079b9b8919dff4d83]
module.public_sg.aws_security_group.main: Refreshing state... [id=sg-0feda0c9e5bab127f]
module.vpc.aws_route.igw_route[0]: Refreshing state... [id=r-rtb-0299c90bb8997687c1080289494]
module.vpc.aws_route_table_association.public_subnets_route_association[0]: Refreshing state... [id=rtbassoc-064ff63696fb58293]
module.vpc.aws_route_table_association.public_subnets_route_association[1]: Refreshing state... [id=rtbassoc-08029f31cc5f59667]
module.rds.aws_db_subnet_group.main: Refreshing state... [id=travelapp-group]
module.ecs_alb.aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:loadbalancer/app/travelapp-alb/b13b73c6f4028e78]
module.ecs_service.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:us-east-1:378842471989:service/travelapp-cluster/travelapp-service]
module.rds.aws_db_instance.main: Refreshing state... [id=db-IEO6HQPSNGGWGCMHYCTH67BEXU]
module.ecs_alb.aws_alb_listener.https_listener[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:listener/app/travelapp-alb/b13b73c6f4028e78/c74bffd3775e6dae]
module.ecs_alb.aws_alb_listener.http_redirect_listener[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:listener/app/travelapp-alb/b13b73c6f4028e78/8ef3767a6a0bcea8]
module.ecs_r53.aws_route53_record.main: Refreshing state... [id=Z00595491K8FFQ0O1DVA_travelapp.bernatei.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:378842471989:service/travelapp-cluster/travelapp-service"
        name                               = "travelapp-service"
        tags                               = {
            "Name" = "travelapp-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:378842471989:task-definition/travelapp-taskdefintion:11" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_ssm_sops.aws_ssm_parameter.main["DB_NAME"] will be created
  + resource "aws_ssm_parameter" "main" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "DB_NAME"
      + tags           = {
          + "Name" = "DB_NAME"
        }
      + tags_all       = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "DB_NAME"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ecs_taskdef_travelapp.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:378842471989:task-definition/travelapp-taskdefintion:8" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:378842471989:task-definition/travelapp-taskdefintion" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu          = 512
                  - environment  = []
                  - essential    = true
                  - image        = "378842471989.dkr.ecr.us-east-1.amazonaws.com/travelapp-ecr:1"
                  - memory       = 1024
                  - mountPoints  = []
                  - name         = "travelapp-container"
                  - portMappings = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets      = [
                      - {
                          - name      = "DB_HOST"
                          - valueFrom = "arn:aws:ssm:us-east-1:378842471989:parameter/DB_HOSTNAME"
                        },
                      - {
                          - name      = "DB_USERNAME"
                          - valueFrom = "arn:aws:ssm:us-east-1:378842471989:parameter/DB_USERNAME"
                        },
                      - {
                          - name      = "DB_PASSWORD"
                          - valueFrom = "arn:aws:ssm:us-east-1:378842471989:parameter/DB_PASSWORD"
                        },
                    ]
                  - volumesFrom  = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "travelapp-taskdefintion" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
        tags                     = {
            "Name" = "travelapp-taskdefintion"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + DB_NAME_ARN              = (known after apply)
  + rds_db_hostname          = "travelapp-identifier.coh32k3gawkn.us-east-1.rds.amazonaws.com:3306"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @bertei, Action: `pull_request`*